Beefy output for `make plan:`
```
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.quasar.module.ssh-bastion-service.data.template_cloudinit_config.config will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "config"  {
      + base64_encode = false
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = "#!/bin/bash\ncat << EOF > /etc/systemd/system/sshd_worker.socket\n[Unit]\nDescription=SSH Socket for Per-Connection docker ssh container\n\n[Socket]\nListenStream=22\nAccept=true\n\n[Install]\nWantedBy=sockets.target\nEOF\ncat << EOF > /etc/systemd/system/sshd_worker@.service\n[Unit]\nDescription=SSH Per-Connection docker ssh container\n\n[Service]\nType=simple\nExecStart= /usr/bin/docker run --rm -i --hostname staging-us-east-1-vpc-4e8dc229_%i -v /dev/log:/dev/log -v /opt/iam_helper:/opt:ro sshd_worker\nStandardInput=socket\nRuntimeMaxSec=43200\n\n[Install]\nWantedBy=multi-user.target\nEOF\n#set host sshd to run on port 2222 and restart service\nsed -i 's/#Port[[:blank:]]22/Port\\ 2222/'  /etc/ssh/sshd_config\nsystemctl restart sshd.service\nsystemctl enable sshd_worker.socket\nsystemctl start sshd_worker.socket\nsystemctl daemon-reload\n\n#set hostname to match dns\nhostnamectl set-hostname staging-us-east-1-vpc-4e8dc229-vpc-4e8dc229-bastion-host"
          + content_type = "text/x-shellscript"
          + filename     = "module_systemd"
        }
      + part {
          + content      = "#!/bin/bash"
          + content_type = "text/x-shellscript"
          + filename     = "module_ssh_populate_assume_role"
          + merge_type   = "str(append)"
        }
      + part {
          + content      = "#!/bin/bash\nmkdir -p /opt/iam_helper/\ncat << 'EOF' > /opt/iam_helper/ssh_populate.sh\n#!/bin/bash\n(\ncount=1\n/opt/iam-authorized-keys-command | while read line\ndo\n    username=$( echo $line | sed -e 's/^# //' -e 's/+/plus/' -e 's/=/equal/' -e 's/,/comma/' -e 's/@/at/' )\n    useradd -m -s /bin/bash -k /etc/skel $username\n    usermod -a -G sudo $username\n    echo $username\\ 'ALL=(ALL) NOPASSWD:ALL' > /etc/sudoers.d/$count\n    chmod 0440 /etc/sudoers.d/$count\n    count=$(( $count + 1 ))\n    mkdir /home/$username/.ssh\n    read line2\n    echo $line2 >> /home/$username/.ssh/authorized_keys\n    chown -R $username:$username /home/$username/.ssh\n    chmod 700 /home/$username/.ssh\n    chmod 0600 /home/$username/.ssh/authorized_keys\ndone\n\n) > /dev/null 2>&1\n\n/usr/sbin/sshd -i\nEOF\nchmod 0700 /opt/iam_helper/ssh_populate.sh\n"
          + content_type = "text/x-shellscript"
          + filename     = "module_ssh_populate_same_account"
          + merge_type   = "str(append)"
        }
      + part {
          + content      = "#!/bin/bash\n#debian specific set up for docker https://docs.docker.com/install/linux/docker-ce/debian/#install-using-the-repository\napt install -y apt-transport-https ca-certificates curl gnupg2 software-properties-common\ncurl -fsSL https://download.docker.com/linux/$(. /etc/os-release; echo \"$ID\")/gpg | apt-key add -\nadd-apt-repository \"deb [arch=amd64] https://download.docker.com/linux/$(. /etc/os-release; echo \"$ID\") $(lsb_release -cs) stable\"\napt update\napt install -y docker-ce \nsystemctl start docker\nmkdir -p /opt/sshd_worker\n#Write out Dockerfile\ncat << EOF > /opt/sshd_worker/Dockerfile\nFROM ubuntu:16.04\n\nRUN apt-get update && apt-get install -y openssh-server sudo awscli && echo '\\033[1;31mI am a one-time Ubuntu container with passwordless sudo. \\033[1;37;41mI will terminate after 12 hours or else on exit\\033[0m' > /etc/motd && mkdir /var/run/sshd\n\nEXPOSE 22\nCMD [\"/opt/ssh_populate.sh\"]\nEOF\n#Build sshd service container\ncd /opt/sshd_worker\ndocker build -t sshd_worker .\n\n"
          + content_type = "text/x-shellscript"
          + filename     = "module_docker_setup"
          + merge_type   = "str(append)"
        }
      + part {
          + content      = "#!/bin/bash\nmkdir -p /opt/golang/src/iam-authorized-keys-command/\ncat << EOF > /opt/golang/src/iam-authorized-keys-command/main.go\n        // This code is taken from https://github.com/Fullscreen/iam-authorized-keys-command\n// Its responsibility is to query iam service for users that match criteria, and add them to ec2 instance on which this is run\npackage main\n\nimport (\n\t\"fmt\"\n\t\"os\"\n\t\"os/signal\"\n\t\"sync\"\n\t\"syscall\"\n\n\t\"github.com/aws/aws-sdk-go/aws\"\n\t\"github.com/aws/aws-sdk-go/aws/session\"\n\t\"github.com/aws/aws-sdk-go/service/iam\"\n)\n\nconst (\n\texitCodeOk    int = 0\n\texitCodeError int = 1\n)\n\nvar (\n\twg sync.WaitGroup\n\n\tiamGroup    = \"\"\n\tsshUserName = \"\"\n)\n\nfunc main() {\n\tsess, _ := session.NewSession()\n\tsvc := iam.New(sess)\n\n\t// check for valid user name\n\tif sshUserName != \"\" && (len(os.Args) < 2 || os.Args[1] != sshUserName) {\n\t\tos.Exit(exitCodeOk)\n\t}\n\n\t// Handle SIGPIPE\n\t//\n\t// When sshd identifies a key in the stdout of this command, it closes\n\t// the pipe causing a series of EPIPE errors before a SIGPIPE is emitted\n\t// on this scripts pid. If the script exits with the standard 13 code, sshd\n\t// will disregard any matched keys. We catch the signal here and exit 0 to\n\t// fix that problem.\n\tc := make(chan os.Signal, 1)\n\tsignal.Notify(c, syscall.SIGPIPE)\n\tgo func() {\n\t\t_ = <-c\n\t\tos.Exit(exitCodeOk)\n\t}()\n\n\tusers, err := users(svc, iamGroup)\n\tif err != nil {\n\t\tfmt.Fprintln(os.Stderr, err.Error())\n\t\tos.Exit(exitCodeError)\n\t}\n\n\tfor _, u := range users {\n\t\twg.Add(1)\n\t\tgo func(userName *string) {\n\t\t\tparams := &iam.ListSSHPublicKeysInput{\n\t\t\t\tUserName: userName,\n\t\t\t}\n\t\t\tif resp, err := svc.ListSSHPublicKeys(params); err == nil {\n\t\t\t\tfor _, k := range resp.SSHPublicKeys {\n\t\t\t\t\tif *k.Status != \"Active\" {\n\t\t\t\t\t\tcontinue\n\t\t\t\t\t}\n\t\t\t\t\tparams := &iam.GetSSHPublicKeyInput{\n\t\t\t\t\t\tEncoding:       aws.String(\"SSH\"),\n\t\t\t\t\t\tSSHPublicKeyId: k.SSHPublicKeyId,\n\t\t\t\t\t\tUserName:       userName,\n\t\t\t\t\t}\n\t\t\t\t\tresp, err := svc.GetSSHPublicKey(params)\n\t\t\t\t\tif err != nil {\n\t\t\t\t\t\tfmt.Fprintln(os.Stderr, err.Error())\n\t\t\t\t\t}\n\t\t\t\t\tfmt.Printf(\"# %s\\n\", *userName)\n\t\t\t\t\tfmt.Println(*resp.SSHPublicKey.SSHPublicKeyBody)\n\t\t\t\t}\n\t\t\t} else {\n\t\t\t\tfmt.Fprintln(os.Stderr, err.Error())\n\t\t\t}\n\t\t\twg.Done()\n\t\t}(u.UserName)\n\t}\n\twg.Wait()\n}\n\n// get all IAM users, or just those that are part of the defined group\nfunc users(svc *iam.IAM, iamGroup string) ([]*iam.User, error) {\n\tif iamGroup != \"\" {\n\t\tparams := &iam.GetGroupInput{\n\t\t\tGroupName: aws.String(iamGroup),\n\t\t\tMaxItems:  aws.Int64(1000),\n\t\t}\n\t\tresp, err := svc.GetGroup(params)\n\t\treturn resp.Users, err\n\t}\n\tparams := &iam.ListUsersInput{\n\t\tMaxItems: aws.Int64(1000),\n\t}\n\tresp, err := svc.ListUsers(params)\n\treturn resp.Users, err\n}\n\nEOF\nsudo apt-get install -y golang\nexport GOPATH=/opt/golang\n\nCOMMAND_DIR=$GOPATH/src/iam-authorized-keys-command\n\nmkdir -p $COMMAND_DIR\ncd $COMMAND_DIR\n\ngo get ./...\ngo build -ldflags \"-X main.iamGroup=\" -o /opt/iam_helper/iam-authorized-keys-command ./main.go\n"
          + content_type = "text/x-shellscript"
          + filename     = "module_iam-authorized-keys-command"
          + merge_type   = "str(append)"
        }
      + part {
          + content      = "#!/bin/bash"
          + content_type = "text/x-shellscript"
          + filename     = "extra_user_data"
          + merge_type   = "str(append)"
        }
    }

  # module.quasar.module.ssh-bastion-service.aws_autoscaling_group.bastion-service will be created
  + resource "aws_autoscaling_group" "bastion-service" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "us-east-1a",
          + "us-east-1b",
          + "us-east-1c",
          + "us-east-1d",
          + "us-east-1e",
          + "us-east-1f",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "bastion-service-asg"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + tags                      = []
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"
    }

  # module.quasar.module.ssh-bastion-service.aws_iam_instance_profile.bastion_service_profile[0] will be created
  + resource "aws_iam_instance_profile" "bastion_service_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "staging-us-east-1-vpc-4e8dc229_bastion"
      + path        = "/"
      + role        = "staging-us-east-1-vpc-4e8dc229_bastion"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.quasar.module.ssh-bastion-service.aws_iam_policy.check_ssh_authorized_keys[0] will be created
  + resource "aws_iam_policy" "check_ssh_authorized_keys" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "staging-us-east-1-vpc-4e8dc229_bastion"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:ListUsers",
                          + "iam:ListSSHPublicKeys",
                          + "iam:ListGroups",
                          + "iam:GetUser",
                          + "iam:GetSSHPublicKey",
                          + "iam:GetGroup",
                          + "ec2:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.quasar.module.ssh-bastion-service.aws_iam_role.bastion_service_role[0] will be created
  + resource "aws_iam_role" "bastion_service_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-us-east-1-vpc-4e8dc229_bastion"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.quasar.module.ssh-bastion-service.aws_iam_role_policy_attachment.check_ssh_authorized_keys[0] will be created
  + resource "aws_iam_role_policy_attachment" "check_ssh_authorized_keys" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-us-east-1-vpc-4e8dc229_bastion"
    }

  # module.quasar.module.ssh-bastion-service.aws_launch_configuration.bastion-service-host will be created
  + resource "aws_launch_configuration" "bastion-service-host" {
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-0ed2d2283aa1466df"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "bastion-service-host"
      + security_groups             = (known after apply)
      + user_data                   = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.quasar.module.ssh-bastion-service.aws_lb.bastion-service will be created
  + resource "aws_lb" "bastion-service" {
      + arn                              = (known after apply)
      + arn_suffix                       = (known after apply)
      + dns_name                         = (known after apply)
      + enable_cross_zone_load_balancing = true
      + enable_deletion_protection       = false
      + id                               = (known after apply)
      + internal                         = false
      + ip_address_type                  = (known after apply)
      + load_balancer_type               = "network"
      + name                             = "91bf778a86d90357f43c159f32ad2034"
      + security_groups                  = (known after apply)
      + subnets                          = (known after apply)
      + vpc_id                           = (known after apply)
      + zone_id                          = (known after apply)

      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }
    }

  # module.quasar.module.ssh-bastion-service.aws_lb_listener.bastion-service will be created
  + resource "aws_lb_listener" "bastion-service" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 22
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.quasar.module.ssh-bastion-service.aws_lb_target_group.bastion-service will be created
  + resource "aws_lb_target_group" "bastion-service" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + name                               = "91bf778a86d90357f43c159f32ad2034"
      + port                               = 22
      + protocol                           = "TCP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + target_type                        = "instance"
      + vpc_id                             = "vpc-4e8dc229"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "2222"
          + protocol            = "TCP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.quasar.module.ssh-bastion-service.aws_security_group.bastion_service will be created
  + resource "aws_security_group" "bastion_service" {
      + arn                    = (known after apply)
      + description            = "Bastion service"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "staging-bastion-service"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = true
      + vpc_id                 = "vpc-4e8dc229"
    }

  # module.quasar.module.ssh-bastion-service.aws_security_group_rule.bastion_host_out will be created
  + resource "aws_security_group_rule" "bastion_host_out" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "bastion service and host egress"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.quasar.module.ssh-bastion-service.aws_security_group_rule.lb_healthcheck_in will be created
  + resource "aws_security_group_rule" "lb_healthcheck_in" {
      + cidr_blocks              = []
      + description              = "access from load balancer CIDR ranges for healthchecks"
      + from_port                = 2222
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2222
      + type                     = "ingress"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```